docs/tutorials/quickstart.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-11-28 Mon 10:43 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Modulus Quickstart Guide</title>
<meta name="author" content="Connor Redfern" />
<meta name="generator" content="Org Mode" />

<link rel="stylesheet" href="../modulus-style.css" type="text/css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Modulus Quickstart Guide</h1>
<div style="text-align:right">
<p>
<a href="../index.html">Modulus</a> / <a href="index.html">Tutorials</a> / Quickstart
</p>
</div>

<p>
This is a guide for those who want to try out the language without committing to
a full installation. It assumes that you'll be using the web editor, running in
'static' mode, and contains a bunch of small programs for you to try. 
</p>

<div id="outline-container-org223be92" class="outline-2">
<h2 id="org223be92">Actions: Hello, World!</h2>
<div class="outline-text-2" id="text-org223be92">
<p>
The Modulus hello world should be unsurprising to most programmers:
</p>

<div class="org-src-container">
<pre class="src src-modulus"><span style="color: #807f96;">(</span><span style="color: #738FD7;">module</span> main
  <span style="color: #9d81ba;">(</span><span style="color: #738FD7;">import</span>
    sys.console.<span style="color: #d24b83;">&#8278;all</span><span style="color: #9d81ba;">)</span><span style="color: #807f96;">)</span> <span style="color: #545c5e;">;; </span><span style="color: #545c5e;">&#8278;all is like the wildcard import '*'</span>

<span style="color: #807f96;">(</span>main : IO Unit<span style="color: #807f96;">)</span>
<span style="color: #807f96;">(</span><span style="color: #738FD7;">def</span> main <span style="color: #9d81ba;">(</span>put-line <span style="color: #7CF083;">"Hello, world!"</span><span style="color: #9d81ba;">)</span><span style="color: #807f96;">)</span>
</pre>
</div>

<p>
However, Modulus is a pure functional language. This means it distinguishes
between <i>actions</i>, which are things that have an effect (print to the console,
send some data to a socket etc.), and <i>functions</i> or <i>expressions</i>, which simply
compute some value but have no observable effects.
</p>

<p>
The program above defines <code>main</code> to be the <i>action</i> "print hello world". To
sequence multiple actions, we use a <code>do</code> statement, followed by a list of
actions we want to perform:
</p>

<div class="org-src-container">
<pre class="src src-modulus"><span style="color: #807f96;">(</span><span style="color: #738FD7;">module</span> main
  <span style="color: #9d81ba;">(</span><span style="color: #738FD7;">import</span> sys.console.<span style="color: #d24b83;">&#8278;all</span><span style="color: #9d81ba;">)</span><span style="color: #807f96;">)</span>

<span style="color: #807f96;">(</span>main : IO Unit<span style="color: #807f96;">)</span>
<span style="color: #807f96;">(</span><span style="color: #738FD7;">def</span> main
  <span style="color: #9d81ba;">(</span><span style="color: #738FD7;">do</span> <span style="color: #4d9391;">(</span>put-line <span style="color: #7CF083;">"Hello, World!"</span><span style="color: #4d9391;">)</span>
      <span style="color: #4d9391;">(</span>put-line <span style="color: #7CF083;">"Goodbye, World!"</span><span style="color: #4d9391;">)</span><span style="color: #9d81ba;">)</span><span style="color: #807f96;">)</span>
</pre>
</div>
</div>
</div>


<div id="outline-container-org39bcac8" class="outline-2">
<h2 id="org39bcac8">Palindromes</h2>
<div class="outline-text-2" id="text-org39bcac8">
<p>
I mentioned above that modulus distinguishes between <i>actions</i>, which have an
effect, and <i>functions</i>, which do not. As <code>main</code> is an action, we'll define our
first function. It will take a word and return true if that word is a
palindrome, i.e. equal to itself in reverse
</p>

<div class="org-src-container">
<pre class="src src-modulus"><span style="color: #807f96;">(</span><span style="color: #738FD7;">module</span> main
  <span style="color: #9d81ba;">(</span><span style="color: #738FD7;">import</span> 
    prelude.<span style="color: #d24b83;">&#8278;all</span><span style="color: #9d81ba;">)</span><span style="color: #807f96;">)</span>

<span style="color: #807f96;">(</span>is-palindrome : String &#8594; Bool<span style="color: #807f96;">)</span>
<span style="color: #807f96;">(</span><span style="color: #738FD7;">defn</span> is-palindrome <span style="color: #9d81ba;">[</span>word<span style="color: #9d81ba;">]</span>
  <span style="color: #9d81ba;">(</span>word = <span style="color: #4d9391;">(</span>reverse word<span style="color: #4d9391;">)</span><span style="color: #9d81ba;">)</span><span style="color: #807f96;">)</span>
</pre>
</div>

<p>
You can try this function out by right-clicking on it's definition and selecting
"call with value", then entering some word to test out. Try it with "hello" and
"ollo". 
</p>


<div class="org-src-container">
<pre class="src src-modulus"><span style="color: #807f96;">(</span><span style="color: #738FD7;">module</span> main
  <span style="color: #9d81ba;">(</span><span style="color: #738FD7;">import</span>
    prelude.<span style="color: #d24b83;">&#8278;all</span>
    sys.console.<span style="color: #d24b83;">&#8278;all</span><span style="color: #9d81ba;">)</span><span style="color: #807f96;">)</span>

<span style="color: #807f96;">(</span>is-palindrome : String &#8594; Bool<span style="color: #807f96;">)</span>
<span style="color: #807f96;">(</span><span style="color: #738FD7;">defn</span> is-palindrome <span style="color: #9d81ba;">[</span>word<span style="color: #9d81ba;">]</span>
  <span style="color: #9d81ba;">(</span>word = <span style="color: #4d9391;">(</span>reverse word<span style="color: #4d9391;">)</span><span style="color: #9d81ba;">)</span><span style="color: #807f96;">)</span>

<span style="color: #807f96;">(</span>main : IO Unit<span style="color: #807f96;">)</span>
<span style="color: #807f96;">(</span><span style="color: #738FD7;">def</span> main
  <span style="color: #9d81ba;">(</span><span style="color: #738FD7;">do</span> <span style="color: #4d9391;">(</span>word &#8592; get-line<span style="color: #4d9391;">)</span>
      <span style="color: #4d9391;">(</span>put-line <span style="color: #7CF083;">"${word} is ${(if (is-palindrome word) "" "</span>not<span style="color: #7CF083;">")} a palindrome!"</span><span style="color: #4d9391;">)</span><span style="color: #9d81ba;">)</span><span style="color: #807f96;">)</span>
</pre>
</div>
</div>
</div>


<div id="outline-container-org59d85f8" class="outline-2">
<h2 id="org59d85f8">Caesar Cipher</h2>
<div class="outline-text-2" id="text-org59d85f8">
<div class="org-src-container">
<pre class="src src-modulus"><span style="color: #807f96;">(</span><span style="color: #738FD7;">defn</span> caesar <span style="color: #9d81ba;">[</span>word k<span style="color: #9d81ba;">]</span>
  <span style="color: #9d81ba;">(</span><span style="color: #738FD7;">let</span> <span style="color: #4d9391;">[</span><span style="color: #a0586c;">(</span>+|<span style="color: #a0586c;">)</span> <span style="color: #a0586c;">(</span>mod-ring <span style="color: #cea2ca;">27</span><span style="color: #a0586c;">)</span>.<span style="color: #a0586c;">(</span>+<span style="color: #a0586c;">)</span><span style="color: #4d9391;">]</span>
       <span style="color: #4d9391;">[</span>encode <span style="color: #a0586c;">[</span>c<span style="color: #a0586c;">]</span> <span style="color: #a0586c;">(</span>ord c - ord 'a' +| k + ord 'a'<span style="color: #a0586c;">)</span><span style="color: #4d9391;">]</span>
   <span style="color: #4d9391;">(</span>map encode <span style="color: #a0586c;">(</span>to-lower word<span style="color: #a0586c;">)</span><span style="color: #4d9391;">)</span><span style="color: #9d81ba;">)</span><span style="color: #807f96;">)</span>
</pre>
</div>
</div>
</div>


<div id="outline-container-org355f804" class="outline-2">
<h2 id="org355f804">Balanced Parentheses</h2>
<div class="outline-text-2" id="text-org355f804">
<p>
Imagine we have some text like "((2 * (3 + 4) &lt; (((2 - 1) ^ 1))", and want to
check if the parentheses are balanced. 
</p>

<p>
The basic idea is this: first, we want to convert all elements of the array to
numbers. Specifically, we want to map '(' to 1, ')' to -1 and everything else
to 0. So, our string from earlier becomes the array:
</p>

<pre class="example">
(!arr 1 1 0 0 ... 1 ... -1 ... 1 1 1 ... -1 ... -1 -1)
</pre>

<p>
Then, we can break down 'parentheses are balanced' into two sub-properties
</p>
<ul class="org-ul">
<li>The sum of all elements in this array is 0 (same number of '(' and ')')</li>
<li>The <i>running</i> sum of all elements in the array never goes <i>below</i> zero</li>
</ul>
<p>
We can perform this calculation with the below code
</p>

<div class="org-src-container">
<pre class="src src-modulus"><span style="color: #807f96;">(</span>balanced : String &#8594; Bool<span style="color: #807f96;">)</span>
<span style="color: #807f96;">(</span><span style="color: #738FD7;">defn</span> balanced <span style="color: #9d81ba;">[</span>str<span style="color: #9d81ba;">]</span>
  <span style="color: #9d81ba;">(</span><span style="color: #738FD7;">let</span> <span style="color: #4d9391;">[</span>toNum char &#8796; <span style="color: #738FD7;">match</span> char
         <span style="color: #a0586c;">(</span><span style="color: #7CF083;">"("</span> &#8594;  <span style="color: #cea2ca;">1</span><span style="color: #a0586c;">)</span>
         <span style="color: #a0586c;">(</span><span style="color: #7CF083;">")"</span> &#8594; -1<span style="color: #a0586c;">)</span>
         <span style="color: #a0586c;">(</span>_   &#8594;  <span style="color: #cea2ca;">0</span><span style="color: #a0586c;">)</span><span style="color: #4d9391;">]</span>
       <span style="color: #4d9391;">[</span>arr &#8796; map toNum str<span style="color: #4d9391;">]</span>
    <span style="color: #4d9391;">(</span><span style="color: #a0586c;">(</span>sum arr = <span style="color: #cea2ca;">0</span><span style="color: #a0586c;">)</span> &#8743; <span style="color: #a0586c;">(</span><span style="color: #53859d;">&#10216;</span>min <span style="color: #cea2ca;">0</span><span style="color: #53859d;">&#10217;</span>/ <span style="color: #53859d;">(</span><span style="color: #5D8272;">&#10216;</span>- <span style="color: #cea2ca;">0</span><span style="color: #5D8272;">&#10217;</span> \ arr<span style="color: #53859d;">)</span> &gt;= <span style="color: #cea2ca;">0</span><span style="color: #a0586c;">)</span><span style="color: #4d9391;">)</span><span style="color: #9d81ba;">)</span><span style="color: #807f96;">)</span>
</pre>
</div>

<p>
But how exactly does this work?
</p>
<ul class="org-ul">
<li>The first step is to convert the string into the array of 0, 1 and -1's
<ul class="org-ul">
<li>we define a function toNum, which performs a <code>match</code> on its' argument - you
can think of <code>match</code> as being similar to <code>switch</code> from other languages.</li>
</ul></li>
<li>We then use <code>map</code> to apply <code>toNum</code> to each element of the string, which gives
us our array of 1's and 0's</li>
</ul>

<p>
Now we have the array
</p>
</div>
</div>
</div>
</body>
</html>
